Repository: lucidre/sot
Catalog: lib/l10n/app_*.arb
Languages: et

source: System Default
et: Süsteemi vaikeseade

source: English
et: Inglise

source: Arabic
et: araabia keel

source: Estonian
et: eesti keel

source: Error Occurred
et: Esines viga

source: No Data
et: Andmed puuduvad

source: An error occurred with the data fetch, don't worry it is most likely not your fault.
et: Andmete toomisel ilmnes viga, ärge muretsege, see pole tõenäoliselt teie süü.

source: This section currently contains no data; please try again later.
et: See jaotis ei sisalda praegu andmeid; Palun proovi hiljem uuesti.

source: Please select an image.
et: Palun valige pilt.

source: An error occurred while picking your image.
et: Teie pildi valimisel ilmnes viga.

source: No network connection
et: Võrguühendus puudub

source: Widget has to inclue child or title
et: Vidin peab sisaldama lapse või pealkirja

source: Widget can not include both child and title
et: Vidin ei tohi sisaldada nii alam- kui ka pealkirja

source: An error occurred with the data fetch, please try again later
et: Andmete toomisel ilmnes viga, proovige hiljem uuesti

source: All
et: Kõik

source: Greater than 10
et: Suurem kui 10

source: Greater than 30
et: Rohkem kui 30

source: Greater than 50
et: Rohkem kui 50

source: Male
et: Mees

source: Female
et: Naine

source: Up to 20%
et: kuni 20%

# a50AndAbove
source: 50% and above
et: 50% ja üle selle

source: Foot Wears
et: Jalg kannab

source: Cooperate Wears
et: Cooper Wears

source: Casual Wears
et: Vabaajarõivad

source: Face
et: Nägu

source: Others
et: teised

source: Popularity
et: Populaarsus

source: New In
et: Uus sisse

source: Lowest Price
et: Madalaim hind

source: Highest Price
et: Kõrgeim hind

source: Please enter the pin you recieved
et: Sisestage saadud PIN-kood

source: Please enter the complete pin
et: Sisestage täielik PIN-kood

source: Otp Verification
et: OTP kinnitamine

source: Enter the OTP that was sent to your account
et: Sisestage teie kontole saadetud OTP

source: Verify
et: Kinnitage

source: Resend User Otp
et: Saada uuesti kasutaja Otp

source: Please wait while we resend your verification OTP
et: Palun oodake, kuni saadame teie kinnituse OTP uuesti

source: A verification OTP has been sent to your mail
et: Kinnituse OTP on saadetud teie e-posti aadressile

source: Password
et: Parool

source: Please provide your password'
et: Palun sisestage oma parool

source: Password must be more than 6 letters
et: Parool peab olema pikem kui 6 tähte

source: Passwords must be the same
et: Paroolid peavad olema samad

source: Retype Password
et: Tippige parool uuesti

source: Password Change
et: Parooli muutmine

source: 'Enter a new password for your account
et: „Sisestage oma kontole uus parool

source: Change Password
et: Muuda salasõna

source: Your password has successfully been changed
et: Teie parool on edukalt muudetud

source: Your password has been successfully changed, please login again
et: Teie parool on edukalt muudetud, palun logige uuesti sisse

source: Email
et: Meil

source: Please provide your email.
et: Sisestage oma e-posti aadress.

source: Please enter a valid email
et: Palun sisesta kehtiv email

source: Email Verification
et: E-posti kinnitamine

# kindlyEnterYourEmailAndWellSendAnOtpToRecoverYourPassword
source: Kindly enter your email and weâ€™ll send an OTP to recover your password
et: Sisestage oma e-posti aadress ja me saadame teie parooli taastamiseks OTP

source: Send OTP
et: Saada OTP

source: Reset Password
et: Lähtestage parool

source: Forgot Password
et: Unustasid parooli

source: Account Verification
et: Konto kinnitamine

source: Kindly verfiy your account to gain access to the application
et: Rakendusele juurdepääsu saamiseks kinnitage oma konto

source: Login
et: Logi sisse

source: Login to your account
et: Logige oma kontole sisse

# forgotPasswordWithQuestionMark
source: Forgot Password?
et: Unustasid parooli?

source: Sign In
et: Logi sisse

source: Create an Account
et: Kontot looma

source: Terms
et: Tingimused

source: and
et: ja

source: Conditions
et: Tingimused

source: of use
et: kasutamisest

source: Kindly select your country
et: Palun valige oma riik

source: Kindly accept the application terms and conditions to proceed
et: Jätkamiseks nõustuge taotlemise tingimustega

source: Registration successful, kindly check your mail to activate your account
et: Registreerimine õnnestus, kontrollige oma e-posti konto aktiveerimiseks

source: Create your account
et: Loo enda konto

source: Sign Up
et: Registreeri

source: Log In
et: Logi sisse

source: I agree to the
et: ma nõustun

source: Search Country.
et: Otsi riiki.

source: The inputted email is unavailiable
et: Sisestatud meil ei ole saadaval

source: Full Name
et: Täisnimi

source: Please provide your full name
et: Esitage oma täisnimi

source: 'Verify Account
et: „Kinnitage konto

source: Your account is not verified;
et: Teie konto pole kinnitatud;

source: Kindly enter the OTP that was sent to your account.
et: Palun sisestage teie kontole saadetud OTP.

source: Resend OTP
et: Saada OTP uuesti

source: Your email has successfully been verified
et: Teie e-posti aadress on edukalt kinnitatud

source: A new OTP has been sent to your mail
et: Teie e-postile on saadetud uus OTP

source: Clear Filter
et: Tühjenda filter

source: Apply
et: Rakenda

source: Price Range
et: Hinnavahemik

source: Qunatity Availiable
et: Saadaval kogus

source: Gender
et: Sugu

source: Discount
et: Allahindlus

source: Category
et: Kategooria

source: Sort By
et: Sorteerima

source: Categories
et: Kategooriad

source: Latest News
et: Viimased uudised

source: Lucky Picks!!
et: Õnnelikud valikud!!

source: New Products
et: Uued tooted

source: An error occurred with the download, please try again later
et: Allalaadimisel ilmnes viga, proovige hiljem uuesti

source: Download Started
et: Allalaadimine algas

source: Image downloaded to
et: Pilt laaditi alla

source: View Images
et: Vaata pilte

source: Setting up chatroom, please wait
et: Jututoa seadistamine, palun oodake

source: News Feed
et: Uudistevoog

source: Search
et: Otsing

source: Your account details has recently been update, please login again.
et: Teie konto üksikasju on hiljuti värskendatud, palun logige uuesti sisse.

source: An error occrred setting up your profile, please login again
et: Teie profiili seadistamisel ilmnes viga, palun logige uuesti sisse

source: An error occrred setting up your profile, please try again
et: Teie profiili seadistamisel ilmnes viga, proovige uuesti

source: An error occurred, please try again'
et: Ilmnes viga, palun proovi uuesti'

source: Please connect to a network and try again
et: Ühendage võrguga ja proovige uuesti

source: Country
et: Riik

source: Display Currency
et: Kuva valuuta

source: Please select your country
et: Valige oma riik

source: Please select your preferred currency
et: Valige eelistatud valuuta

# aContinue
source: Continue
et: Jätka

source: Kindly note that your selected currency would be used to control the display prices of the products but this would only affect the payment price of products as all payment would be made in the dollar equivalent.
et: Pange tähele, et teie valitud valuutat kasutatakse toodete kuvamishindade kontrollimiseks, kuid see mõjutab ainult toodete maksehinda, kuna kõik maksed tehakse dollari ekvivalendis.

source: Okay
et: Okei

source: Preferred base currency
et: Eelistatud baasvaluuta

source: Select your preferred currency
et: Valige eelistatud valuuta

source: Select your country
et: Valige oma riik

source: Edit Address
et: Redigeeri aadressi

source: Save
et: Salvesta

source: Delete Address
et: Kustuta aadress

source: Do you want to remove this address from your list?
et: Kas soovite selle aadressi oma loendist eemaldada?

source: Cancel
et: Tühista

source: Delete
et: Kustuta

source: Postcode
et: Postiindeks

source: Please provide your postal code.
et: Sisestage oma postiindeks.

source: Please enter a valid postal code.
et: Sisestage kehtiv sihtnumber.

source: State
et: osariik

source: Please provide your state.
et: Esitage oma osariik.

source: Delivery Address
et: Saaja aadress

source: Please provide your delivery address.
et: Esitage oma kohaletoimetamise aadress.

source: Address Book
et: Aadressiraamat

source: Add new address
et: Lisa uus aadress

source: No Saved Addresses
et: Salvestatud aadresse pole

source: You do not have any saved addresses, try saving one to make order processes faster
et: Teil pole ühtegi salvestatud aadressi. Tellimusprotsesside kiirendamiseks proovige see salvestada

source: Postal Code
et: Postiindeks

source: Contact Detail
et: Kontaktandmed

source: Add Contact
et: Lisa kontakt

source: Phone Number
et: Telefoninumber

source: Phone Number (Primary)
et: Telefoninumber (peamine)

source: Please enter your primary contact number
et: Sisestage oma esmane kontaktnumber

source: Select Phone Code.
et: Valige Telefonikood.

source: Your selected country would be used as an additional factor to tailor the products we display.
et: Teie valitud riiki kasutatakse lisategurina meie kuvatavate toodete kohandamisel.

source: Update
et: Värskenda

source: Currency
et: Valuuta

source: Your selected currency would be used to control the display currency of the products.
et: Teie valitud valuutat kasutatakse toodete kuvamisvaluuta juhtimiseks.

source: Kindly note that this would only affect the display price and all payments would be made in the dollar equivalent of the price.
et: Pange tähele, et see mõjutab ainult kuvamishinda ja kõik maksed tehakse hinna ekvivalendis dollarites.

source: Language
et: Keel

source: Your selected lauguage would be used to control the display language of the application.
et: Teie valitud keelt kasutatakse rakenduse kuvakeele juhtimiseks.

source: Contact Us
et: Võta meiega ühendust

source: Kindly use any of the medium below to contact us
et: Palun kasutage meiega ühenduse võtmiseks mõnda allolevatest meediumitest

source: Your Account
et: Sinu konto

source: Contact Details
et: Kontaktandmed

source: Your Orders
et: Teie tellimused

source: Ratings and Reviews
et: Hinnangud ja ülevaated

source: Logout
et: Logi välja

source: Do you want to log out of this device, this would clear all your personal data stored on the application
et: Kui soovite sellest seadmest välja logida, kustutatakse kõik teie rakenduses salvestatud isikuandmed

source: Confirm
et: Kinnita

source: Do you want to change your account password; kindly note that changing your account password would log you out of every other signed in device
et: Kas soovite oma konto parooli muuta; Pange tähele, et konto parooli muutmine logib teid kõigist teistest sisselogitud seadmetest välja

source: Account Setup
et: Konto seadistamine

source: Legal Policies
et: Õiguspoliitika

source: Terms and Conditions
et: Tingimused

source: Privacy Policies
et: Privaatsuspoliitika

source: Help & Contact
et: Abi ja kontakt

source: Application Settings
et: Rakenduse sätted

source: About
et: Umbes

source: Open-source License
et: Avatud lähtekoodiga litsents

source: Search for Clothings, Shoes, Accessories and more
et: Otsige rõivaid, jalatseid, aksessuaare ja palju muud

source: Home
et: Kodu

source: Gallery
et: Galerii

source: Account
et: Konto
